In [15]:
import pandas as pd
import numpy as np

In [6]:
eat_out=pd.read_csv('./Data/외식지수.csv',encoding='euc-kr',header=1)
eat_out.head()

        시점      외식
0  1985.01  21.026
1  1985.02  21.079
2  1985.03  21.132
3  1985.04  21.184
4  1985.05  21.184

In [25]:
eat_out['시점'] = eat_out['시점'].astype(np.str0).str.replace('.','/')
eat_out['시점'] = pd.to_datetime(eat_out['시점'],format='%Y/%m')
eat_out.columns=['날짜','외식']

/var/folders/vf/8xq5853s7zdffbbxdf_fk_xc0000gn/T/ipykernel_18969/2806292266.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  eat_out['시점'] = eat_out['시점'].astype(np.str0).str.replace('.','/')

In [28]:
eat_out

            날짜       외식
0   1985-01-01   21.026
1   1985-02-01   21.079
2   1985-03-01   21.132
3   1985-04-01   21.184
4   1985-05-01   21.184
..         ...      ...
452 2022-09-01  112.800
453 2022-01-01  113.160
454 2022-11-01  113.480
455 2022-12-01  114.030
456 2023-01-01  114.620

[457 rows x 2 columns]

In [35]:
target = pd.read_csv('./Data/rice_target.csv')
target['날짜']=pd.to_datetime(target['날짜'],format='%Y-%m-%d')
target.sort_values(by='날짜').reset_index(drop=True)

            날짜    년도   월    소비량
0   1997-11-01  1997  11  277.8
1   1997-12-01  1997  12  275.3
2   1998-01-01  1998   1  285.7
3   1998-01-01  1998   1  270.3
4   1998-02-01  1998   2  266.7
..         ...   ...  ..    ...
295 2022-05-01  2022   5  154.1
296 2022-06-01  2022   6  154.8
297 2022-07-01  2022   7  150.7
298 2022-08-01  2022   8  151.8
299 2022-09-01  2022   9  153.7

[300 rows x 4 columns]

In [45]:
df=pd.merge(target,eat_out,on='날짜',how='inner')
df

            날짜    년도   월    소비량       외식
0   1997-11-01  1997  11  277.8   58.163
1   1997-12-01  1997  12  275.3   58.851
2   1998-01-01  1998   1  285.7   60.699
3   1998-01-01  1998   1  285.7   60.118
4   1998-01-01  1998   1  270.3   60.699
..         ...   ...  ..    ...      ...
345 2022-05-01  2022   5  154.1  109.810
346 2022-06-01  2022   6  154.8  110.670
347 2022-07-01  2022   7  150.7  111.390
348 2022-08-01  2022   8  151.8  112.200
349 2022-09-01  2022   9  153.7  112.800

[350 rows x 5 columns]

In [54]:
data = df['외식'].to_numpy().reshape(-1,1)
target = df['소비량'].to_numpy()

In [51]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [55]:
x_train , x_test , y_train , y_test = \
    train_test_split(data,target)

In [58]:
lr = LinearRegression()
lr.fit(x_train,y_train)
lr.score(x_test,y_test)

0.9093256011539436